### Steps for building first ANN

* Data Preprocessing
* Add input layer
* Random w inirt
* Add hidden layers
* Select optimizer, Loss and Performance metrics
* Compile the model
* Use model.fit to train the model
* Evaluate the model
* Adjust Optimization parameters or model if needed

In [158]:
# install tensorflow 
#!pip install tensorflow

In [159]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten, Dense

In [160]:
print(tf.__version__)

2.7.0

In [161]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [162]:
dataset = pd.read_csv('Customer_Churn_Modelling.csv')

In [163]:
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [164]:
X = dataset.drop(labels=['RowNumber','CustomerId','Surname','Exited'],axis =1)
y = dataset['Exited']

In [165]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [166]:
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [167]:
from sklearn.preprocessing import LabelEncoder

In [168]:
label1 = LabelEncoder()
X['Geography']= label1.fit_transform(X['Geography'])

In [169]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,Female,42,2,0.00,1,1,1,101348.88
1,608,2,Female,41,1,83807.86,1,0,1,112542.58
2,502,0,Female,42,8,159660.80,3,1,0,113931.57
3,699,0,Female,39,1,0.00,2,0,0,93826.63
4,850,2,Female,43,2,125510.82,1,1,1,79084.10

In [170]:
X['Gender'] = label1.fit_transform(X['Gender'])

In [171]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,2,0,43,2,125510.82,1,1,1,79084.10

In [172]:
X = pd.get_dummies(X,drop_first=True,columns=['Geography'])
X.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_1,Geography_2
0,619,0,42,2,0.00,1,1,1,101348.88,0,0
1,608,0,41,1,83807.86,1,0,1,112542.58,0,1
2,502,0,42,8,159660.80,3,1,0,113931.57,0,0
3,699,0,39,1,0.00,2,0,0,93826.63,0,0
4,850,0,43,2,125510.82,1,1,1,79084.10,0,1

### Feature Standardization

In [173]:
from sklearn.preprocessing import StandardScaler

In [174]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state = 0, stratify = y)

In [175]:
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [176]:
X_train

array([[-1.24021723, -1.09665089,  0.77986083, ...,  1.64099027,
        -0.57812007, -0.57504086],
       [ 0.75974873,  0.91186722, -0.27382717, ..., -1.55587522,
         1.72974448, -0.57504086],
       [-1.72725557, -1.09665089, -0.9443559 , ...,  1.1038111 ,
        -0.57812007, -0.57504086],
       ...,
       [-0.51484098,  0.91186722,  0.87565065, ..., -1.01507508,
         1.72974448, -0.57504086],
       [ 0.73902369, -1.09665089, -0.36961699, ..., -1.47887193,
        -0.57812007, -0.57504086],
       [ 0.95663657,  0.91186722, -1.32751517, ...,  0.50945854,
        -0.57812007,  1.73900686]])

### Build ANN

In [177]:
model = Sequential()
model.add(Dense(X.shape[1],activation = 'relu', input_dim= X.shape[1]))
model.add(Dense(128, activation = 'relu'))
model.add(Dense(1, activation = 'sigmoid'))

In [178]:
X.shape[1]

11

In [179]:
model.compile(optimizer = 'adam',loss = 'binary_crossentropy',metrics =['accuracy'])

In [180]:
model.fit(X_train, y_train.to_numpy(), batch_size = 10, epochs = 10, verbose = 1) # since X_train is a numpy array so y_train should be also numpy array. convert via to_numpy

Epoch 1/10
800/800 [==============================] - 1s 574us/step - loss: 0.4516 - accuracy: 0.8019
Epoch 2/10
800/800 [==============================] - 0s 575us/step - loss: 0.4029 - accuracy: 0.8289
Epoch 3/10
800/800 [==============================] - 0s 570us/step - loss: 0.3661 - accuracy: 0.8510
Epoch 4/10
800/800 [==============================] - 0s 567us/step - loss: 0.3520 - accuracy: 0.8560
Epoch 5/10
800/800 [==============================] - 0s 570us/step - loss: 0.3463 - accuracy: 0.8579
Epoch 6/10
800/800 [==============================] - 0s 578us/step - loss: 0.3423 - accuracy: 0.8549
Epoch 7/10
800/800 [==============================] - 0s 589us/step - loss: 0.3386 - accuracy: 0.8608
Epoch 8/10
800/800 [==============================] - 0s 570us/step - loss: 0.3358 - accuracy: 0.8599
Epoch 9/10
800/800 [==============================] - 0s 573us/step - loss: 0.3331 - accuracy: 0.8627
Epoch 10/10
800/800 [==============================] - 0s 574us/step - loss: 0.3307 - accuracy: 0.8601

In [181]:
#y_pred = model.predict+_classes(X_test)  # removed after version tensorflow 2.5. instead use model.predict(X_test)
#y_pred

In [182]:
model.evaluate(X_test,y_test.to_numpy())

63/63 [==============================] - 0s 483us/step - loss: 0.3498 - accuracy: 0.8555

[0.3498378098011017, 0.8554999828338623]

In [183]:
from sklearn.metrics import confusion_matrix, accuracy_score

In [184]:
#confusion_matrix(y_test,y_pred)

In [185]:
#accuracy_score(y_test,y_predd)